#!/usr/bin/python
# coding: utf-8
# 顺丰快递每天能收到成千上万的物流单，每个物流单的重量不一。 现在顺丰快递的货车司机隔壁老王开着顺丰的标配货车（限载5吨，含5吨，不考虑限高）,想要一次性拿走尽可能重的货物，这些货有红木沙发，有钢材等等。
#
# 以下是货物清单：
#
# 货物编号   货物重量(单位:kg)
# 1         509
# 2         838
# 3         924
# 4         650
# 5         604
# 6         793
# 7         564
# 8         651
# 9         697
# 10        649
# 11        747
# 12        787
# 13        701
# 14        605
# 15        644
# 请在答题框下输入你想装运的货物的编号，用-分隔。
#
# 比如1-2-3代表同时装入编号为1,2,3的货物，此时货物总重为509（1号货物）+838（2号货物）+924（3号货物）=2271kg,远小于限载额——5吨，隔壁老王会被吐槽的。
#
# 比如1-5-8-9-11-12-14代表同时装入编号为1,5,8,9,11,12,14的货物，此时货物总重为509（1号货物）+604（5号货物）+651（8号货物）+697（9号货物）747（11号货物）+787（12号货物）+605（14号货物）=4600kg，这时与限载额5吨就比较接近了，隔壁老王会很高兴……

conduct = [509, 838, 924, 650, 604, 793, 564, 651, 697, 649, 747, 787, 701, 605, 644]


def solv(i, j):
    "求最大值 i文件编号，j权重"
    if(i < 0):
        return 0
    if(j > conduct[i]):
        rt = max(solv(i - 1, j), solv(i - 1, j - conduct[i]) + conduct[i])
        return rt
    else:
        return solv(i - 1, j)

# ans = solv(14, 5000)
# print(ans)


def search(i, j):
    "求解路径"
    summer = 0
    while(i >= 0 and j >= 0):
        if(solv(i, j) == solv(i - 1, j - conduct[i]) + conduct[i]):
            summer += conduct[i]
            print("index:" + str(i + 1) + "  weight:" + str(conduct[i]))
            j -= conduct[i]
        i -= 1
    return summer

print(search(14, 5000))
